// pages/myself/declare.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    declares: [
      { tip: "简介", content:"互动问答是近年来兴起的信息咨询的交流模式，互动问答目前都是基于商业的互动问答，本次设计基于同学们喜爱的微信平台研发校园内的大学生问答服务平台--“蜂窝v校园”，针对大学生校内学习交流、师生互动的特点，提出了平台的建设的总体设计方案,为方便学生答疑咨询、提升服务质量提供新思路"},
      {tip:"使用方法",content:"问题探讨:主页—>问题探讨—>点击加号状发布按钮—>填写相应信息并发布。问题页面可以对其他用户发布的问题进行解答。问题随机分布，问题页面下拉刷新问题列表。文章发布:主页—>文章发表，填写相应信息然后进入文章详情页面,点击添加按钮添加标签、风格等标签，点击选择图片为文章添加配图，点击箭头状按钮选择发表或者预览文章。由于篇幅太大这里不一一介绍，其他功能请用户自行探索"},
      {tip: "《“蜂窝V校园”使用注意事项》",content:"用户在使用此程序的时候请注意:不得发表与学习无关的言论，例如:侮辱、诽谤他人、政治敏感话题、低俗、暴力、淫秽、伤害民族情感、煽动性等言论。不得使用血腥，淫秽，暴力图片作为问题与文章发表的配图。“蜂窝V校园”管理员拥有终止违反规定的用户使用“蜂窝V校园”的使用权的权限，请用户按照《“蜂窝V校园”使用注意事项》正确使用“蜂窝V校园”，构建文明和谐的互联网环境"},
      { tip: "法律声明", content:"“蜂窝V校园”内用户交流内容均为用户自主发布交流,“蜂窝V校园”开发团队对用户上传内容概不负责!如果用户因发表不合法言论构成犯罪的，由用户自行承担责任"}
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})